In [1]:
import pandas as pd

df_cus = pd.read_csv('C:/Users/nikit/Study/БОЛЬШИЕГОРОДА/BD/Customers.csv', sep = ';')
df_emp = pd.read_excel('C:/Users/nikit/Study/БОЛЬШИЕГОРОДА/BD/Employees.xlsx')
df_ord = pd.read_csv('C:/Users/nikit/Study/БОЛЬШИЕГОРОДА/BD/Orders.csv', sep = ';')
df_ord['OrderDate'] = pd.to_datetime(df_ord['OrderDate'])
df_prod = pd.read_csv('C:/Users/nikit/Study/БОЛЬШИЕГОРОДА/BD/Products.csv', sep = ';')
df_odet = pd.read_csv('C:/Users/nikit/Study/БОЛЬШИЕГОРОДА/BD/Order_details.csv', sep = ';')

In [2]:
len(df_cus[df_cus['ContactTitle'] == 'Owner']) #1.1

17

In [3]:
len(df_cus[df_cus['ContactName'].str[0] == 'A']) #1.2

10

In [4]:
len(df_cus[df_cus['Phone'].str.contains('5555')]) #1.3

2

In [5]:
len(df_cus[df_cus['ContactTitle'].isin(['Owner','Sales Representative'])]) #1.4

34

In [6]:
df_cus.groupby('ContactTitle').ContactTitle.count() #1.5

ContactTitle
Accounting Manager                10
Assistant Sales Agent              2
Assistant Sales Representative     1
Marketing Assistant                6
Marketing Manager                 12
Order Administrator                2
Owner                             17
Owner/Marketing Assistant          1
Sales Agent                        5
Sales Associate                    7
Sales Manager                     11
Sales Representative              17
Name: ContactTitle, dtype: int64

In [7]:
len(df_ord[df_ord['OrderDate'] > '1997-07-05']) #2.1

488

In [8]:
len(df_ord[df_ord['Freight'] <= 10.98])      #2.2

184

In [9]:
_help = df_ord[(df_ord['Freight'] > 500) & (df_ord['OrderDate'].between('1997-01-01','1997-12-31'))] #2.3
_help

,OrderID,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,Freight
231,10479,RATTC,3,1997-03-19,1997-04-16 00:00:00.000,1997-03-21 00:00:00.000,708.95
266,10514,ERNSH,3,1997-04-22,1997-05-20 00:00:00.000,1997-05-16 00:00:00.000,789.95
292,10540,QUICK,3,1997-05-19,1997-06-16 00:00:00.000,1997-06-13 00:00:00.000,1007.64
364,10612,SAVEA,1,1997-07-28,1997-08-25 00:00:00.000,1997-08-01 00:00:00.000,544.08
443,10691,QUICK,2,1997-10-03,1997-11-14 00:00:00.000,1997-10-22 00:00:00.000,810.05

In [10]:
len(_help)

5

In [11]:
_help = df_ord[(df_ord['Freight'] > 500) | (df_ord['OrderDate'].between('1997-01-01','1997-12-31'))] #2.3
_help

,OrderID,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,Freight
124,10372,QUEEN,5,1996-12-04,1997-01-01 00:00:00.000,1996-12-09 00:00:00.000,890.78
152,10400,EASTC,1,1997-01-01,1997-01-29 00:00:00.000,1997-01-16 00:00:00.000,83.93
153,10401,RATTC,1,1997-01-01,1997-01-29 00:00:00.000,1997-01-10 00:00:00.000,12.51
154,10402,ERNSH,8,1997-01-02,1997-02-13 00:00:00.000,1997-01-10 00:00:00.000,67.88
155,10403,ERNSH,4,1997-01-03,1997-01-31 00:00:00.000,1997-01-09 00:00:00.000,73.79
...,...,...,...,...,...,...,...
664,10912,HUNGO,2,1998-02-26,1998-03-26 00:00:00.000,1998-03-18 00:00:00.000,580.91
735,10983,SAVEA,2,1998-03-27,1998-04-24 00:00:00.000,1998-04-06 00:00:00.000,657.54
769,11017,ERNSH,9,1998-04-13,1998-05-11 00:00:00.000,1998-04-20 00:00:00.000,754.26
782,11030,SAVEA,7,1998-04-17,1998-05-15 00:00:00.000,1998-04-27 00:00:00.000,830.75
784,11032,WHITC,2,1998-04-17,1998-05-15 00:00:00.000,1998-04-23 00:00:00.000,606.19

In [12]:
len(_help)

416

In [13]:
df_ord[df_ord['OrderDate'].between('1997-01-01','1997-12-31')].sort_values('Freight', ascending= False)['OrderID'].values[0] # 2.4

np.int64(10540)

In [14]:
df_ord[df_ord['OrderDate'].between('1997-01-01','1997-12-31') & (df_ord['CustomerID'] == 'ANTON')].sort_values(['CustomerID','Freight'])['Freight'].values[0]
#2.5

np.float64(4.03)

In [15]:
print(df_ord['Freight'].agg(['min','max']))
print('Разница: ', df_ord['Freight'].max() - df_ord['Freight'].min()) # 2.6

min       0.02
max    1007.64
Name: Freight, dtype: float64
Разница:  1007.62

In [16]:
df_ord[df_ord['OrderDate'] == '1998-02-26'].Freight.sum() #2.7 ##

np.float64(776.27)

In [17]:
df_ord.groupby('EmployeeID').EmployeeID.count().idxmin() #2.8

np.int64(5)

In [18]:
pd.to_datetime(df_ord.groupby('OrderDate').OrderDate.count().idxmax()).strftime('%Y%m%d') #2.9

'19980226'

In [19]:
df_ord.groupby(['EmployeeID', 'CustomerID']).OrderID.count().max() #2.10

np.int64(6)

In [20]:
len(df_prod[df_prod['UnitPrice'].between(18,22)]) #3

16

In [21]:
df_odet['ActualDiscount'] = df_odet['UnitPrice'] * df_odet['Quantity'] * df_odet['Discount']
df_odet['NetRevenue'] = df_odet['UnitPrice'] * df_odet['Quantity'] - df_odet['ActualDiscount']  #4.1
df_odet

,OrderID,ProductID,UnitPrice,Quantity,Discount,ActualDiscount,NetRevenue
0,10248,11,14.00,12,0.00,0.000,168.000
1,10248,42,9.80,10,0.00,0.000,98.000
2,10248,72,34.80,5,0.00,0.000,174.000
3,10249,14,18.60,9,0.00,0.000,167.400
4,10249,51,42.40,40,0.00,0.000,1696.000
...,...,...,...,...,...,...,...
2150,11077,64,33.25,2,0.03,1.995,64.505
2151,11077,66,17.00,1,0.00,0.000,17.000
2152,11077,73,15.00,2,0.01,0.300,29.700
2153,11077,75,7.75,4,0.00,0.000,31.000
2154,11077,77,13.00,2,0.00,0.000,26.000

In [22]:
_helpDf = df_odet.groupby('OrderID').agg({
    'ActualDiscount': 'sum',
    'NetRevenue': 'sum'
}).reset_index()
_helpDf

     OrderID  ActualDiscount  NetRevenue
0      10248          0.0000    440.0000
1      10249          0.0000   1863.4000
2      10250        260.4000   1552.6000
3      10251         16.7400    654.0600
4      10252        132.1000   3597.9000
..       ...             ...         ...
825    11073          0.0000    300.0000
826    11074         12.2150    232.0850
827    11075         87.9000    498.1000
828    11076        264.2500    792.7500
829    11077        118.8795   1255.7205

[830 rows x 3 columns]

In [23]:
len(_helpDf[_helpDf['ActualDiscount'] > 2000])

5

In [24]:
#4.2  #######################
ord = df_odet.groupby('OrderID').NetRevenue.sum().idxmax()
ordRev = df_odet.groupby('OrderID').NetRevenue.sum().max()
print(f"Заказ: {ord}, чистая выручка: {ordRev}")

Заказ: 10865, чистая выручка: 16387.5

In [25]:
df_emp[df_emp['EmployeeID'] == df_ord.groupby('EmployeeID').EmployeeID.count().idxmax()][['FirstName', 'LastName']] #5

  FirstName LastName
3  Margaret  Peacock

In [26]:
_help = df_ord.merge(df_odet.groupby('OrderID').NetRevenue.sum().reset_index(), how = 'right').merge(df_cus)
_help[_help['CustomerID'] == _help.groupby('CustomerID').NetRevenue.sum().idxmax()]['ContactName'].head(1)  #6

25    Horst Kloss
Name: ContactName, dtype: object

In [27]:
_help = df_odet.merge(df_prod).groupby(['CategoryID','CategoryName']).NetRevenue.sum().reset_index().sort_values('NetRevenue')
_help.tail(1)#['CategoryName'] #7 ######################

   CategoryID CategoryName  NetRevenue
0           1    Beverages    184562.3

In [28]:
_help[_help['CategoryName'] == 'Confections']#['NetRevenue'] #8 ###########

   CategoryID CategoryName  NetRevenue
2           3  Confections   117716.36